In [1]:
import pandas as pd
import numpy as np

In [2]:
raw_data = {'team': ['Ten Snakes', 'Ten Snakes', 'Ten Snakes', 'Ten Snakes', 
                                    'Nine Monkeys', 'Nine Monkeys', 'Nine Monkeys', 'Nine Monkeys', 
                                    'Eight Eagles', 'Eight Eagles'], 
        'rank': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '2nd'], 
        'name': ['James', 'Allen', 'Matthew', 'James', 'Devon', 'Sam', 'Justin', 'Sam', 'Paul', 'Ross'], 
        'score1': [16,35,55,29,2,61,68,41,94,18],
        'score2': [81,65,54,44,28,93,2,5,53,99]}
df = pd.DataFrame(raw_data, columns = ['team', 'rank', 'name', 'score1', 'score2'])

df2 = df.set_index(['team','rank'])
df2

                      name  score1  score2
team         rank
Ten Snakes   1st     James      16      81
             1st     Allen      35      65
             2nd   Matthew      55      54
             2nd     James      29      44
Nine Monkeys 1st     Devon       2      28
             1st       Sam      61      93
             2nd    Justin      68       2
             2nd       Sam      41       5
Eight Eagles 1st      Paul      94      53
             2nd      Ross      18      99

In [3]:
grouped2 = df2.groupby(level=['team', 'rank'])

In [14]:
def above_50(x):
    return (x.score1.min() > 50) and (x.score2.min() > 50)
    
grouped2.filter(above_50)

                   name  score1  score2
team         rank
Eight Eagles 1st   Paul      94      53

In [15]:
list(grouped2)

[(('Eight Eagles', '1st'),
                     name  score1  score2
  team         rank
  Eight Eagles 1st   Paul      94      53),
 (('Eight Eagles', '2nd'),
                     name  score1  score2
  team         rank
  Eight Eagles 2nd   Ross      18      99),
 (('Nine Monkeys', '1st'),
                      name  score1  score2
  team         rank
  Nine Monkeys 1st   Devon       2      28
               1st     Sam      61      93),
 (('Nine Monkeys', '2nd'),
                       name  score1  score2
  team         rank
  Nine Monkeys 2nd   Justin      68       2
               2nd      Sam      41       5),
 (('Ten Snakes', '1st'),
                    name  score1  score2
  team       rank
  Ten Snakes 1st   James      16      81
             1st   Allen      35      65),
 (('Ten Snakes', '2nd'),
                      name  score1  score2
  team       rank
  Ten Snakes 2nd   Matthew      55      54
             2nd     James      29      44)]